; English language file v3.9.1
; Author: bursoft
; In the codepage key must be specified code page number for this language (eg 1251 for the Russian, 1253 for the Greek, and so on).
bat_lang=en
codepage=1252
error=ERROR^!
startup_error1=Batch ApkTool do not have full access to the folder, or installation path contains invalid characters
startup_error2=Batch ApkTool do not have permissions to write to the folder
previous_java1=You have installed Java
previous_java2=Batch ApkTool works properly only with Java 8 or above
get_java=Get latest Java here https://www.java.com/en/download/
java_notfound=Java was not found
ON=YES
OFF=NO
MANUAL=MANUAL
project=Current project                             
currentapk=Selected APK                                
currentjar=Selected JAR                                
apilevel=API level                                 
keepbroken=keep broken resources                     
buildexpert=build in EXPERT mode                                                 
dontwritedebug=Do not include debug info in smali          
signafter=Sign output APKs                            
key=key for signing                           
openlog=Open log                                                              
language=Language                                    
deodexall=Deodex all APKs and JARs                    
copy_deodexed_apk=Copy deodexed APKs to _INPUT_APK            
copy_deodexed_jar=Copy deodexed JARs to _INPUT_JAR            
baksmaliapk=Decompile APKs (only smali)
smaliapk=Recompile APKs
baksmalijar=Decompile JARs (only smali)
smalijar=Recompile JARs
decompile=Decompile APKs                              
decompile_r=Decompile APKs (only resources)             
recompile=Recompile APKs                              
signfiles=Sign files
zipalfiles=Zipalign files
viewsource=View Java source code
plugins=Plug-ins >
selplugin=SELECT PLUG-IN:
adbmenu=ADB:
devices=devices                                     
install=install >                                   
rootremount=root, remount                               
pull=pull >                                      
push=push >                                      
screenshot=screenshot                                  
screenrecord=screenrecord
shell=shell
logs=logs >
reboot=reboot >
info=info
kill-server=kill-server
servicemenu=SERVICE:
cleanup1=Clean up _framework, _system                
cleanup2=Clean up _INPUT_APK, _INPUT_JAR             
cleanup3=Clean up _OUT_APK, _OUT_JAR  
cleanup4=Clean up ALL folders
exitmenu=EXIT
choosetask=PLEASE CHOOSE TASK:
instframe=Installing framework
instframe_error=Error installing framework
inputapk_empty=Put files for decompiling to _INPUT_APK folder. See readme.txt for details.
decompiling=Decompiling
decompiling_error=Error decompiling
recompiling=Recompiling
recompiling_error=Error recompiling
orignotfound=Error. Original file not found.
backupnotfound=Error. _backup folder not found.
done=DONE
signing=Signing
signing_error=Error signing
doneerrors=DONE with ^!error_count^! ERRORS.
zipal=Zipaligning
zipal_error=Error zipaligning
selectviewer=Select Java source code viewer:
cancel=CANCEL
makechoice=Please make your choice:
dragajd=drag APK, JAR or DEX file here:
genjava=Generating Java code from
genjava_error=Error generating Java code from
apilevel_log=API level                   
buildexpert_log=Build in EXPERT mode        
signafter_log=Sign output APKs            
press1=Press ENTER to continue or input 1 to open log:
deletedialog=Delete all files in the following folders:
proceed=Proceed?
yes=YES
selproj=SELECT PROJECT:
createnewproj=Create new project
usedefproj=Use default project
inputprojname=Input project name:
selectapk=SELECT APK:
allapks=All APKs in _INPUT_APK
selectjar=SELECT JAR:
alljars=All JARs in _INPUT_JAR
selectapktool=SELECT APKTOOL:
selectsmali=SELECT SMALI:
aversions=Android version
apilevels=API level      
enterapi=Enter API level:
invalidapi=Invalid API level^!
selectkey=SELECT KEY:
selectlang=SELECT LANGUAGE:
framework_empty=Put all framework files to _system\framework folder. See readme.txt for details.
deodexing=Deodexing
notodexed=File not odexed.
smerror=Error smaling
bsmerror=Error baksmaling
bootnotfound=boot.oat not found
selectarch=SELECT boot.oat ARCHITECTURE:
selectedarch=Architecture
extractboot=Extracting and deodexing boot.oat...
extractboot_error=Error extracting boot.oat
errorunp=Error unpacking
deodexing_error=Error deodexing
baksmaling=Baksmaling
smaling=Smaling
connection_type=Connection type:
input_ip=Input device IP and port, for example 192.168.1.3:40404:
input_ip2=Input device IP or press ENTER to use the last IP
installtodef=Install to default memory:
singlefile=Single file
allfrom=All files from
installtosd=Install to SD:
dragtoinstall=Drag APK to install here:
installing=Installing
pull2=Pull:
pushto=Push to
dragtopush=Drag file to push here:
screensavedto=Screenshot saved to file
closetostop=Close this window to stop record
scrrecsavedto=Screen record saved to file
logcatr=radio
logcate=events
toscreen=show and save to file
tofile=Save to file
bugreport=Bugreport:
inlinetable=Inline method table:
saved_to_file=Log saved to file
android_version=Android Version:
brand=Brand:
model=Model:
reboot2=Reboot:
reboot3=Reboot
rebootto=Reboot to
symlinks=SYMLINKS
copied_files=Copied files:
old_smali_used=For deodexing select smali 2.2 or higher
already_deodexed=File already deodexed.
onefrom=One file from
alt_method=alternative method
tool_for_deodex=Tool for deodexing Android 6.x-7.x                                    
del_symlinks=Delete symlinks after deodexing                                       
rewrite_opt=Warn overwrite folder before decompilation                            
warn_rewrite1=Found folder with decompiled application
warn_rewrite2=Input 1 to rewrite folder or press ENTER to cancel:
sound_opt=Sound notifications                                                   
manifest_opt=Save original AndroidManifest.xml                                     
AUTO=AUTO
AUTO+=AUTO+
necessary_files_missing=Further work of Batch ApkTool is impossible, because one or more necessary files are missing
dex_notfound=The file does not contain classes.dex, it must be deodexed before decompiling.
elapsed_time=Elapsed time
elapsed_h=h.
elapsed_m=min.
elapsed_s=sec.
tool_for_deodex_vdex=Tool for deodexing Android 8.x                                        
device_warning=For deodexing Android 9.x, you need to connect the device\emulator via ADB. Connect it (menu item [10]) and start deodexing again.
signing_scheme_opt=APK signing scheme                                                    
use_aapt_2=AAPT version (only for apktool v2.x)                                   
back_to_main_menu=Back to main menu
set_postfix=Instead of overwriting, add a sequence number to the output filename  
dex_compression=Compression level for .dex files                                       
dex_compression_text=Set the compression level (0 - no compression, 9 - maximum compression)
res_mode=resolve resources mode                    
force_sign_v1=Force add signature v1                                                
produce_v4_sign=Additionally create a v4 signature file (.idsig)                      
enable_expert_mode=Activate expert mode                                                   
expert_mode_disabled=Expert mode is deactivated
input_ip3=Select connection or input IP and port
devices_not_found=ADB devices not found
adbcontrol=scrcpy                                      
pullfrom=Copy from
push2=Push to device
current_folder=Current folder
connect_qr=Connect using QR code
merge_apks=Merge split APK                             
merging=Merging
adbfilemanager=filemanager >                               
adbpm=package manager >                           
adbpkg=Package manager
pkgall=Show ALL packages
pkgsys=Show SYSTEM packages
pkgusr=Show USER packages
pkgdis=Show DISABLED packages
pkgdel=Show DELETED packages
pkglist=Load packages list from file